uploads/xml/Travelport-Request-664a1d6f4d126-5684.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:LowFareSearchReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:com="http://www.travelport.com/schema/common_v51_0" SolutionResult="false" TargetBranch="P3763969" TraceId="f4bf8d923deed7b92156b09346adb3bb">
      <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="LPA"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="LBV"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2024-06-10"/>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="LBV"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="LPA"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2024-06-11"/>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:AirSearchModifiers>
        <air:PreferredProviders>
          <com:Provider Code="1G"/>
        </air:PreferredProviders>
      </air:AirSearchModifiers>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <air:AirPricingModifiers CurrencyType="SAR"/>
    </air:LowFareSearchReq>
  </soapenv:Body>
</soapenv:Envelope>
